---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.FunctionId
source: html/39ad42b9-faf5-ee4b-a6e8-df4b75269b13.htm
---
# FunctionId Properties

The name of the file including the function throwing an exception.